[{"Course Title" : "CMP_SC 1000:  Introduction to Computer Science","Description" : "This course introduces the Computer Science field, including the history of computers, career opportunities, and ethical/social issues.  There will be lectures given by MU Computer Science faculty to discuss exciting fields as well as career advisement given by Computer Science industry representatives.  Prerequisites: Restricted to freshman/sophomore students who are BS Computer Science, BS Information Technology and Undeclared Engineering or Pre-Engineering may enroll in the class without permission","Credit Hour(s)" : "1"},{"Course Title" : "CMP_SC 1001:  Topics in Computer Science","Description" : "Topic and credit may vary from semester to semester. May be repeated upon consent of department.","Credit Hour(s)" : "1-99"},{"Course Title" : "CMP_SC 1050:  Algorithm Design and Programming I","Description" : "This course provides experience in developing algorithms, designing, implementing programs. Topics include syntax/semantics, flow control, loops, recursion, I/O, arrays, strings and pointers.","Credit Hour(s)" : "3"},{"Course Title" : "CMP_SC 2001:  Topics in Computer Science","Description" : "Topic and credit may vary from semester to semester. May be repeated upon consent of department."," Credit Hour(s)" : "1-99","Prerequisites" : "C- or higher in MATH 1100 or MATH 1160 or MATH 1500.  May be restricted to Engineering majors only"},{"Course Title" : "CMP_SC 2050:  Algorithm Design and Programming II","Description" : "A study of fundamental techniques and algorithms for representing and manipulating data structures. Topics include data abstraction, recursion, stacks, queues, linked lists, trees, efficient methods of sorting and searching, and Big-O analysis."," Credit Hour(s)" : "3","Prerequisites" : "departmental consent"},{"Course Title" : "CMP_SC 2111:  Production Languages","Description" : "The study of the syntax, semantics, and applications of one programming language suitable for large scale scientific or commercial projects, such as FORTRAN, COBOL, PL/1, C, or ADA. May be taken more than once for credit."," Credit Hour(s)" : "1-3","Prerequisites" : "C- or higher in CMP_SC 1050. May be restricted to Engineering majors only"},{"Course Title" : "CMP_SC 2270:  Introduction to Digital Logic","Description" : "Basic tools, methods and procedures to design combinational and sequential digital circuits and systems, including number systems, boolean algebra, logic minimization, adder design, memory elements, and finite state machine design."," Credit Hour(s)" : "3","Prerequisites" : "C- or higher in CMP_SC 2050"},{"Course Title" : "CMP_SC 2830:  Introduction to the Internet, WWW and Multimedia Systems","Description" : "This course will attempt to provide a comprehensive understanding of the evolution, the technologies, and the tools of the Internet. In particular, issues pertaining to the World Wide Web and Multimedia (HTML, CGI, Web based applications) will be discussed in detail."," Credit Hour(s)" : "3","Prerequisites" : "C- or higher in CMP_SC 1050"},{"Course Title" : "CMP_SC 3001:  Topics in Computer Science","Description" : "Current and new technical developments in computer science.  May be repeated for 6 hours credit."," Credit Hour(s)" : "1-99","Prerequisites" : "C- or higher in CMP_SC 2050"},{"Course Title" : "CMP_SC 3050:  Advanced Algorithm Design","Description" : "This class surveys fundamental algorithms and data structures that have wide practical applicability, including search trees and graph algorithms.  Emphasis is placed on techniques for efficient implementation and good software development methodologies."," Credit Hour(s)" : "3","Prerequisites" : "departmental consent. For juniors and seniors"},{"Course Title" : "CMP_SC 3280:  Computer Organization and Assembly Language","Description" : "Introduces computer architectures, programming concepts including parameter passing, I/O, interrupt handling, DMA, memory systems, cache, and virtual memory. Graded of A-F basis only."," Credit Hour(s)" : "3","Prerequisites" : "CMP_SC 2050 with a C or higher"},{"Course Title" : "CMP_SC 3330:  Object Oriented Programming","Description" : "This course focuses on object-oriented programming concepts:  abstraction, polymorphism, encapsulation, inheritance, interfaces, abstract classes, files, streams, and object serialization.  Topics such as GUI and event-driven programming are also tackled."," Credit Hour(s)" : "3","Prerequisites" : "C- or higher in CMP_SC 2270 or ECE 1210"},{"Course Title" : "CMP_SC 3380:  Database Applications and Information Systems","Description" : "Covers fundamental topics of database management systems (DBMS) and database-enabled applications.  Topics include a brief history of secondary storage and databases, data modeling, introductory SQL, an overview of current database trends, and current popular database systems. Graded on A-F basis only."," Credit Hour(s)" : "3","Prerequisites" : "CMP_SC 2050 with a C or higher grade"},{"Course Title" : "CMP_SC 3530:  UNIX Operating System","Description" : "Introduction to the UNIX operating system and its interfaces including the file system, shell, editors, pipes and filters, input/output system, shell programming, program development including C, and document preparation."," Credit Hour(s)" : "3","Prerequisites" : "C- or higher in CMP_SC 2050"}]